<h1>Практическая 3</h1>
<h2>Задание 1</h2>
<?php
$a = 5;
$b = 10;
$res = $a < $b ? $a + $b : $a * $b;
echo $res;
?>

<h2>Задание 2</h2>
<?php
$n = 245;
$res = $n % 2 == 0 ? "четное" : "нечетное";
echo $res;
?>

<h2>Задание 3</h2>
<?php
$sum =900;
$res3 = $sum  > 1000 ? $sum * 0.9 : $sum * 0.95;
echo $res3; 
?>

<h2>Задание 4</h2>
<?php
$a = 5;
$b = 7;
$c = 10;
$res4 = $a + $b > $c && $a + $c > $b && $b + $c > $a ? "существует" : "ну существует";
echo $res4;
?>

<h2>Задание 5</h2>
<?php
$age = 7;
$res5 = ($age <= 1) ? 'Котята' : (($age <= 3) ? 'Молодые' : (($age <= 7) ? 'Средних лет' : 'Почтенные'));
echo $res5;
?>

<h2>Задание 6</h2>
<?php
$a = 45;
$c = 90;
$d = 180 - $a - $c;
 
?>