<h1>Практическая 3</h1>
<h2>Задание 1</h2>
<?php
$a = 5;
$b = 10;
$res = $a < $b ? $a + $b : $a * $b;
echo $res;
?>

<h2>Задание 2</h2>
<?php
$n = 245;
$res = $n % 2 == 0 ? "четное" : "нечетное";
echo $res;
?>

<h2>Задание 3</h2>
<?php
$sum =900;
$res3 = $sum  > 1000 ? $sum * 0.9 : $sum * 0.95;
echo $res3; 
?>

<h2>Задание 4</h2>
<?php
$a = 5;
$b = 7;
$c = 10;
$res4 = $a + $b > $c && $a + $c > $b && $b + $c > $a ? "существует" : "ну существует";
echo $res4;
?>

<h2>Задание 5</h2>
<?php
$age = 7;
$res5 = ($age <= 1) ? 'Котята' : (($age <= 3) ? 'Молодые' : (($age <= 7) ? 'Средних лет' : 'Почтенные'));
echo $res5;
?>

<h2>Задание 6</h2>
<?php
$a = 45;
$c = 90;
$d = 180 - $a - $c;
 
?>
<h2>match</h2>
<h3>Задание 1</h3>
<?php
$a = 3;
$res = match($a) {
0 => 'zero' , 1 => 'one' , 2 => 'two' , 3 => 'three' ,  4 => 'four' , 5 =>  'five' , 6 => 'six' , 7 =>  'seven' , 8 => 'eight' , 9 => 'nine' ,
};
echo $res;
?>
<h3>Задание 2</h3>
<?php
$m = 1;
$h = match($m) {
    1 => '1 января — Новый год, 7 января — Рождество',
    2 => '23 февраля — День защитника Отечества',
    3 => '8 марта — Международный женский день',
    4 => '1 апреля — День смеха',
    5 => '1 мая — Праздник Весны и Труда, 9 мая — День Победы',
    6 => '12 июня — День России',
    7 => '8 июля — День семьи',
    8 => '22 августа — День флага',
    9 => '1 сентября — День знаний',
    10 => '5 октября — День учителя',
    11 => '4 ноября — День народного единства',
    12 => '31 декабря — Новый год', 
};
echo $h;
?>
<h3> Задание 3</h3>
<?php
$num = 7; 
$l = $num % 10; 
$lDS = match($l) {
    0 => 0, 1 => 1, 2 => 4, 3 => 9, 4 => 6,
    5 => 5, 6 => 6, 7 => 9, 8 => 4, 9 => 1
};
echo "Последняя цифра квадрата: $lDS";
?>
<h3>Задание 4</h3>
<?php
$k = 22;
$lT = $k % 100;
$lO = $k % 10;

$t = match(true) {
    ($lT >= 11 && $lT <= 14) => 'лет',
    ($lO == 1) => 'год',
    ($lO >= 2 && $lO <= 4) => 'года',
};
echo "Мне $k $t";
?>
<h3>Задание 5</h3>
<?php
$u = 4;
$m = 2.5; 

$k = match($u) {
    1 => 1,
    2 => 0.000001,
    3 => 0.001,
    4 => 1000,
    5 => 100,
};

echo $m * $k . " кг";
?>